var data ={
    "0": [
        "RPA 工程師",
        "德義資訊股份有限公司 | 網路相關",
        "面議（經常性薪資4萬/月含以上）",
        "Application Architect-Business Process Automation\n熟悉Uipath RPA、SAP工具"
    ],
    "1": [
        "Banking RPA solution",
        "德義資訊股份有限公司 | 網路相關",
        "面議（經常性薪資4萬/月含以上）",
        "1、程式撰寫\n2、熟悉Uipath PRA工具"
    ],
    "2": [
        "C1S0-RPA Developer(北投)",
        "康舒科技股份有限公司 | 其他電子零組件相關",
        "面議（經常性薪資4萬/月含以上）",
        "1.收集和分析業務需求，確定適合自動化的流程\n2.使用RPA工具和技術來開發和實施RPA解決方案，包括流程設計、流程自動化、錯誤處理和報告\n3.進行RPA解決方案的測試和優化，確保其穩定性和效能\n4.監視和管理RPA解決方案的營運狀況資訊管理學類,電機工程學類,電子工程學類"
    ],
    "3": [
        "RPA軟體開發工程師_新竹_00058",
        "緯創資通股份有限公司(緯創資通) | 電腦╱週邊設備製造",
        "月薪 37,000~70,000元",
        "【請您至緯創官方網站進行投遞】https://jobs.wistron.com/#/app\n官網投遞之履歷將優先審閱，請您以個人信箱進行帳號註冊，以利後續與您進行聯繫，謝謝！\n\n1. RPA專案程式開發編寫\n2. 程式維護及產品技術支援\n3. 使用者需求溝通討論並優化作業資訊管理學類,資訊工程學類"
    ],
    "4": [
        "【顧問部】顧問師/高級顧問師/副理 (RPA技術顧問)-317317",
        "KPMG_安侯建業聯合會計師事務所 | 會計服務",
        "面議（經常性薪資4萬/月含以上）",
        "1. 協助企業持續提升營運流程效率，建立智能流程自動化的營運能力。\n2. 進行RPA解決方案安裝、執行設定、開發、測試與上線工作，整合多元應用系統，運用RPA應用軟體工具，整合跨系統/應用軟體作業流程，建構數位企業轉型的人機協作的營運模式。\n3. 研究RPA與智能自動化前瞻科技技術與趨勢發展，發展RPA多元商業應用情境。\n4. 協助其他Ad-hoc的工作項目(如RPA教育訓練、媒體曝光以及演講簡報內容製作)。"
    ],
    "5": [
        "軟體工程師(MIS)",
        "合匯股份有限公司(Intersource Group Inc.) | 汽車╱零件製造",
        "月薪 28,000~35,000元",
        "1.RPA系統維護管理，作業流程建置導入\n2.確認各部門申請作業流程需求並評估可行性\n3.RPA系統流程腳本撰寫及測試\n4.RPA系統整合測試、個案架構規劃與建置\n5.RPA系統教育訓練及訓練文件製作\n6.RPA系統異常排除\n7.RPA系統使用諮詢，障礙排除、技術支援\n8.RPA系統報表開發、軟體專案協作開發\n9.其他系統支援協助\n10.主管交辦事項\n11.配合加班普通小型車,普通重機車"
    ],
    "6": [
        "【Start up! 2023實習-在台達開創你的達時代！】B2B EDI實習生_資訊處(台北)",
        "台達電子工業股份有限公司 | 其他電子零組件相關",
        "月薪 28,000元以上",
        "2023台達實習招募熱烈進行中，歡迎 你/妳 與我們一起進步成長！\n\n◎工作職掌：\n1.B2B 上下游EDI程式開發測試、維運 (Java)\n2.SAP PI/ Software AG WebMethod \n3.RPA工具技術研習 (UiPath, etc.)\n4.RPA流桯分析及開發\n\n◎實習條件：\n一年期實習資訊工程學類,資訊管理學類"
    ],
    "7": [
        "人力資源自動化整合專案一年期約聘助理 - 身心障礙人才招募",
        "台灣積體電路製造股份有限公司(台積電)(台積電) | 半導體製造",
        "月薪 33,000元",
        "【本職缺接受台積電官方網站與1111投遞】\n請至台積電官方網站投遞個人履歷表，此職缺履歷登錄網址:https://bit.ly/42GXC5D\n\n【TSMC為維護身心障礙者就業權益，特別規劃聘僱身障人才專區，歡迎領有身障手冊者加入TSMC的大家庭！】\n\nDescription:\n我們正在尋找有熱情且具備創新思維的程式相關好手加入人力資源策略夥伴(HR Business)團隊，您將與內部HR及IT專家共同合作，提供有效的人力資源解決方案，成為更專業、更有洞見之高效能/效率(2E, Effectiveness & Efficiency)專業團隊，這個角色提供了一個極好的機會，可以擴展你的職業生涯及工作視野。您需要有使用巨集、RPA或其他自動化工具的經驗，並對自動化整合專案感興趣，且符合下述要求，歡迎投遞履歷，我們期待與您合作!\n\n職責：\n1.負責開發和維護自動化腳本，包括巨集、RPA或其他自動化工具，以提高業務流程的效率\n2.分析業務流程，識別自動化的機會和潛在問題\n3.與其他團隊成員合作，確保自動化整合專案的順利完成\n4.提供技術支援和問題解決方案，以確保自動化工具的穩定運行\n5.月薪33,000元起\n\nQualifications:\n\n必要條件:\n1.需具備有效身心障礙手冊\n2.有自動化工具的開發和維護經驗，包括巨集、RPA或其他自動化工具\n3.能夠獨立分析業務流程，識別自動化的機會和潛在問題\n4.具有解決問題和創新思維的能力\n5.擅長與其他團隊成員合作，以確保自動化整合專案的順利完成\n6.良好的溝通能力\n\n\n加分條件：\n1.有熟練使用Excel、VBA等巨集編程技能的經驗\n2.有熟練使用RPA工具，如UiPath, Automation Anywhere等的經驗\n3.有編寫自動化測試腳本的經驗\n4.熟悉數據庫和SQL查詢\n5.能流暢撰寫至少一種其他程式語言，例如R、Python等"
    ],
    "8": [
        "程式設計師 (具經驗)",
        "彰化商業銀行股份有限公司(彰化銀行) | 銀行",
        "月薪 42,000元以上",
        "※必要資格條件\n1.學歷：國內、外大專(含)以上畢業，且已取得畢業證書。\n2.工作經驗：具備2年以上資訊系統開發經驗。\n3.專業能力(至少符合下列其中一項條件)：\n (1)電子銀行、行動APP、FinTech系統開發設計經驗。\n (2)Microservice、RESTful API設計經驗。\n (3)熟悉RPA開發工具並具備RPA、Web–base或Win Form系統開發經驗。\n (4)熟悉SQL/JAVA/.Net/C#/JavaScript/HTML5/\n    jQuery/Hibernate。\n (5)具Spring Boot/Spring MVC/Angular/React  /Vue/Jenkins等開發經驗。 \n\n◎可配合職務需要，於假日或夜間來行處理業務需求與國外出差。\n※口試得加分條件\n1.具備金融資訊系統開發建置工作經驗(如：存款、授信、防制洗錢、信託、保險、信用卡等)。\n2.熟悉IBM大型主機、AS400、AIX、Linux系統操作者尤佳。\n3.熟悉SQL Server/Oracle/DB2/Teradata資料庫使用尤佳。\n4.熟悉Eclipse開發工具尤佳。\n5.COBOL程式開發或大型主機（Mainframe）經驗。\n\n\n僅受理下列路徑填寫履歷之報名資料，請〝務必〝複製此路徑填寫應徵資訊，並請詳閱甄試簡章:\n彰化銀行/菁英招募/職缺公告\nhttps://www.bankchb.com/frontend/mashup.jsp?funcId=9a7f8ddf15"
    ],
    "9": [
        "程式設計師(限112年度應屆畢業)",
        "彰化商業銀行股份有限公司(彰化銀行) | 銀行",
        "月薪 42,000元以上",
        "※必要資格條件\n1.學歷：國內、外大學(含)以上資訊或理工相關科系所畢業，且報到時已取得112年度畢業證書。\n2.需檢附在校歷年成績單(附歷年排名)。\n3.曾修習程式語言課程或接受相關訓練，並利用該程式語言撰寫作品或專題，能出具成績單或其他證明。\n\n◎可配合職務需要，於假日或夜間來行處理業務需求與國外出差。\n\n※口試得加分條件\n1.電子銀行、行動APP、FinTech系統開發設計經驗。\n2.Microservice、RESTful API設計經驗。\n3.熟悉RPA開發工具並具備RPA、Web–base或Win Form系統開發經驗。\n4.熟悉SQL/JAVA/.Net/C#/JavaScript/HTML5/\n jQuery/Hibernate。\n5.具Spring Boot/Spring MVC/Angular/React  /Vue/Jenkins等開發經驗。\n6.具備金融資訊系統開發建置工作經驗(如：存款、授信、防制洗錢、信託、保險、信用卡等)。\n7.熟悉SQL Server/Oracle/DB2/Teradata資料庫使用尤佳。\n8.熟悉IBM大型主機、AS400、AIX、Linux系統操作者尤佳。\n9.COBOL程式開發或大型主機（Mainframe）經驗。\n\n\n僅受理下列路徑填寫履歷之報名資料，請〝務必〝複製此路徑填寫應徵資訊，並請詳閱甄試簡章:\n彰化銀行/菁英招募/職缺公告\nhttps://www.bankchb.com/frontend/mashup.jsp?funcId=9a7f8ddf15"
    ],
    "10": [
        "結算部作業服務組經辦人員",
        "凱基證券股份有限公司 | 證券╱期貨╱基金",
        "月薪 30,000~50,000元",
        "作業流程優化 : 負責流程優化，含結算及營業員之紙本作業線上化。\n作業流程自動化 : 結算審查作業導入RPA自動化。\n績效及管理指標 : 制定Dashboard 以及生產力KPI。財政學類,會計學類證券商業務員"
    ],
    "11": [
        "Z-系統分析開發工程師 (台北)",
        "永豐餘投資控股股份有限公司 | 紙相關製造",
        "面議（經常性薪資4萬/月含以上）",
        "1.網頁應用系統維護、開發\n2.RPA開發資訊工程學類,資訊管理學類"
    ],
    "12": [
        "結算部作業服務組覆核人員",
        "凱基證券股份有限公司 | 證券╱期貨╱基金",
        "月薪 36,000~60,000元",
        "作業流程優化 : 負責流程優化，含結算及營業員之紙本作業線上化。\n作業流程自動化 : 結算審查作業導入RPA自動化。\n績效及管理指標 : 制定Dashboard 以及生產力KPI。財政學類,會計學類證券商業務員"
    ],
    "13": [
        "Engineer / Senior Engineer, MIS",
        "英屬開曼群島商互動寬頻股份有限公司台灣分公司 | 其他電信╱通訊相關",
        "面議（經常性薪資4萬/月含以上）",
        "一、應用系統開發、維護及管理：\n　　1. EasyFlow系統\n　　2. PBI系統\n　　3. RPA系統\n　　4. SAP 系統整合\n二、系統相關專案管理\n三、系統及專案文件撰寫\n四、使用者教育訓練資訊工程學類,資訊管理學類"
    ],
    "14": [
        "G006GL1_維運工程師",
        "神通資訊科技股份有限公司 | 電腦軟體相關",
        "面議（經常性薪資4萬/月含以上）",
        "1.系統導入、規畫與執行(AD Server、VMWare)\n2.熟網路相關技術與基本故障排除(Windows/Linux)\n3.有程式能力經驗(Script、RPA)或資料庫維護，包含建立、測試、更新及修改\n4.相關系統文件撰寫\n5.其它主管交辦事項\n\n※工作待遇：將依學經歷進行敘薪"
    ],
    "15": [
        "個金_作業規劃人員(專案)",
        "中國信託商業銀行股份有限公司(中國信託) | 銀行",
        "面議（經常性薪資4萬/月含以上）",
        "1.個人金融數位專案規劃及推動\n2.新科技運用與導入，進行分行客戶旅程數位化設計與規劃執行\n   (含視訊、穿戴科技、RPA應用)\n3.分析各項回饋數據，定期產出營運成效商業及管理學門"
    ],
    "16": [
        "人工智慧資料科學家",
        "聯發科技股份有限公司 | IC設計相關",
        "面議（經常性薪資4萬/月含以上）",
        "1. 負責建立與改善軟體開發流程相關的資訊系統及自動化機制\n2. 負責建置與維護〝持續整合(CI)〝、〝持續交付(CD)〝相關資訊系統與服務\n3．新技術或軟體開發方法調研與導入，例如: AI, RPA等"
    ],
    "17": [
        "IT 部門主管/工程師 ( IT Manager/Engineer)",
        "台灣三住股份有限公司 | 其他電子零組件相關",
        "面議（經常性薪資4萬/月含以上）",
        "1.\t基礎設備管理，以提供高度可用、具有成本效益和安全的環境來運行業務。\n        Infrastructure management to provide highly available, cost-effective, and \n        secure environment to run business.\n\n2.\t根據集團標準和當地法規，對資料庫、網路、伺服器和資料中心進行技術設計 \n        和支援。\n       Technical design and support on Databases, Network, Servers, and \n       Datacenters as per Group standard and local regulatory.\n\n3.\tIT運營管理，包括補丁、備份、漏洞、事件和變更管理。\n        IT Operation, including Patching, Backup, Vulnerability, Incident and \n        Change management.\n\n4.\tIT安全工程，以滿足標準、審計和監管要求。\n        IT Security engineering to meet standard, Auditing, and regulatory \n        requirements.\n\n5.\t與總部、各分公司IT部門、專案負責人、安全團隊、審計人員、開發人員、供\n        應商、 業務夥伴和用戶進行有效合作。\n        Effective collaboration with Head office, Regional IT, Project Leaders, \n        security teams, auditors, developers, vendors, business partners and \n        users."
    ],
    "18": [
        "財務自動化流程開發資深管理師",
        "聯發科技股份有限公司 | IC設計相關",
        "面議（經常性薪資4萬/月含以上）",
        "1. 財務流程優化、自動化導入、開發及維護\n2. 與IT合作導入財務解決方案，如圖像轉文字、語意辨識、機器學習以及深度學習等技術。會計學類,財務金融學類,資訊工程學類"
    ],
    "19": [
        "數位轉型軟體工程師",
        "聚陽實業股份有限公司 | 紡織成衣",
        "面議（經常性薪資4萬/月含以上）",
        "1. 作業流程與數位轉型專案的需求訪談、分析、規劃與建置\n2. 使用 UiPath 開發RPA自動化流程, 並持續優化及維護\n3. 協助系統上線、測試及問題排除"
    ],
    "20": [
        "職涯大師",
        "缺工潮來襲5大產業工作機會"
    ],
    "21": [
        "薪資公秤",
        "職涯規劃的好幫手"
    ],
    "22": [
        "九大職能星",
        "最詳盡的薪資調查"
    ],
    "23": [
        "自傳魔法師",
        "性向測驗，開拓職涯新方向"
    ],
    "24": [
        "履歷健診",
        "1分鐘搞定自傳"
    ],
    "25": [
        "職涯規劃的好幫手"
    ]
}

const fs = require("fs");
target =[]

var jd = Object.values(data) 

jd.forEach(element => {  
    if (element.length<3){
        console.log("skeip")
    }else{
        newobj = {
            "jobTitle":element[0],
            "salary": element[2],
            "company": element[1],
            "description":element[4]}
    }
    target.push(newobj)

});
var examp = {"jobTitle": "RPA consultant",
        "salary": "全職",
        "company": "",
        "description": ""}



fs.writeFileSync("./new1111.json",JSON.stringify(target,null,4))